IDEA Open Model
SupportType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Types of support
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[FlagsAttribute]
public enum SupportType
<FlagsAttribute>
Public Enumeration SupportType
Members
Member name | Value | Description
NoSupport | 1 |  Without support
Hinge | 2 |  Hinge type
Rigid | 4 |  Rigid type
HingeNoSupport | 3 |  Combination of hinge and nosupport
HingeHinge | 2 |  Combination of hinge and hinge
RigidNoSupport | 5 |  Combination of rigid and nosupport
RigidHinge | 6 |  Combination of rigid and hinge
RigidRigid | 4 |  Combination of rigid and rigid
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace